#### FabricSheetAlignment Enumeration

---

|  |
| --- |
| See Also |

Fabric Sheet alignment in the fabric distribution

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum FabricSheetAlignment ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FabricSheetAlignment ``` |

| Visual C++ |
| --- |
| ``` public enum class FabricSheetAlignment ``` |

# Members

| Member name | Description |
| --- | --- |
| Null | The fabric sheets are alignment is not set. |
| StartingEdge | The fabric sheets are aligned to starting edge. |
| EndingEdge | The fabric sheets are aligned to ending edge. |
| BothEdges | The fabric sheets are aligned to starting and ending edge. |

# See Also

Autodesk.Revit.DB.Structure Namespace